cases/openfoam.com/ginTonicCHT/system/ginTonic/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    //- region1 is the surrounding air that we do not consider
    //  type patch based on the numerical system; closed domain will
    //  blow up; therefore inlet/outlet - not 100 percentage physical but
    //  for demonstration okay
    {
        name            top;
        patchInfo
        {
            type            patch;
        }

        constructFrom patches;
        patches (ginTonic_to_domain0);
    }

    //- glass we do not consider either -> wall
    {
        name            fixedWalls;
        patchInfo
        {
            type            wall;
        }
        constructFrom patches;
        patches (ginTonic_to_glass);
    }
);

// ************************************************************************* //
