cases/openfoam.com/ginTonicCHT/constant/thermoPropertiesSolid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    //- Frozen water at -5 (engineeringtoolbox.com)
    specie
    {
        nMoles      1;
        molWeight   18;
    }

    transport
    {
        kappa   2.25;
    }

    thermodynamics
    {
        Hf      0;
        Cp      2027;
    }

    equationOfState
    {
        rho     917.5;
    }
}

// ************************************************************************* //
