cases/openfoam.com/ginTonicCHT/0.orig/ginTonic/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0/ginTonic";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    top
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    fixedWalls
    {
        type            noSlip;
    }
    ginTonic_to_iceCube1
    {
        type            noSlip;
    }
    ginTonic_to_iceCube2
    {
        type            noSlip;
    }
}


// ************************************************************************* //
