cases/openfoam.com/ginTonicCHT/0.orig/ginTonic/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/ginTonic";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    top
    {
        type            calculated;
        value           $internalField;
    }
    fixedWalls
    {
        type            calculated;
        value           $internalField;
    }
    ginTonic_to_iceCube1
    {
        type            calculated;
        value           $internalField;
    }
    ginTonic_to_iceCube2
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
