cases/openfoam.com/ginTonicCHT/0.orig/iceCube1/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/iceCube1";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 258;

boundaryField
{
    isolated
    {
        type            zeroGradient;
    }
    iceCube1_to_ginTonic
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           $internalField;
        kappaMethod     solidThermo;
        Tnbr            T;
    }
}


// ************************************************************************* //
